Examinator/src/DataProcessors/УправлениеДоступомСУО/УправлениеДоступомСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УправлениеДоступомСУО</name>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходВПрограммуРазрешен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияСтандартная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияOpenID</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияОС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьВСпискеВыбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходВВебКабинетРазрешен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПарольУстановлен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрещеноИзменятьПароль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Недействителен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппыДоступаСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппыПользователейСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоступаИстекло</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДоступа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДоступа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Examinator/src/Enums/ТипыШаблоновСообщенийСУО/ТипыШаблоновСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШаблоновСообщенийСУО</name>
  <enumValues>
    <name>АвтоматическаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>РучнаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>СбросПароля</name>
  </enumValues>
  <enumValues>
    <name>ОбъединениеДубликатовПользователей</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/DataProcessors/УправлениеДоступомСУО/Forms/НастроитьДоступ/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоПользователей = Параметры.КоличествоПользователей;
	
	Если КоличествоПользователей = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указаны пользователи, для которых должны быть установлены настройки'"),,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Таблица
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВебКабинетСУ") Тогда
	
		НоваяСтрока = ТаблицаНастроек.Добавить();
		НоваяСтрока.Настройка = НСтр("ru = 'Вход в веб-кабинет разрешен'");
		НоваяСтрока.ИмяСвойства = "ВходВВебКабинетРазрешен";
		НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");	
		НоваяСтрока.Действие = "Заменить";
		НоваяСтрока.РазрешеноМенятьДействие = Ложь;
		
	КонецЕсли;	
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Вход в программу разрешен'");
	НоваяСтрока.ИмяСвойства = "ВходВПрограммуРазрешен";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.Действие = "Заменить";
	НоваяСтрока.РазрешеноМенятьДействие = Ложь;	
		
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Группа доступа'");
	НоваяСтрока.ИмяСвойства = "НоваяГруппаДоступа";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ГруппыДоступа");
	НоваяСтрока.Действие = "Добавить";
	НоваяСтрока.РазрешеноМенятьДействие = Истина;
	НоваяСтрока.ВыборГруппИЭлементов = "Элементы";
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Группа пользователей'");
	НоваяСтрока.ИмяСвойства = "НоваяГруппаПользователей";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ГруппыПользователей");
	НоваяСтрока.Действие = "Добавить";
	НоваяСтрока.РазрешеноМенятьДействие = Истина;	
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Пароль'");
	НоваяСтрока.ИмяСвойства = "Пароль";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Строка");	
	НоваяСтрока.Действие = "Заменить";
	НоваяСтрока.РазрешеноМенятьДействие = Ложь;		
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Имя для входа'");
	НоваяСтрока.ИмяСвойства = "Логин";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Строка");	
	НоваяСтрока.Действие = "Заменить";
	НоваяСтрока.РазрешеноМенятьДействие = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияВремениДоступаКПрограммеСУО") Тогда
	
		НоваяСтрока = ТаблицаНастроек.Добавить();
		НоваяСтрока.Настройка = НСтр("ru = 'Дата окончания доступа'");
		НоваяСтрока.ИмяСвойства = "ДатаОкончанияДоступа";
		НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Дата");	
		НоваяСтрока.Действие = "Заменить";
		НоваяСтрока.РазрешеноМенятьДействие = Ложь;
		
	КонецЕсли;
		
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Показывать в списке выбора'");
	НоваяСтрока.ИмяСвойства = "ПоказыватьВСпискеВыбора";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");	
	НоваяСтрока.Действие = "Заменить";
	НоваяСтрока.РазрешеноМенятьДействие = Ложь;
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Запрещено изменять пароль'");
	НоваяСтрока.ИмяСвойства = "ЗапрещеноИзменятьПароль";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");	
	НоваяСтрока.Действие = "Заменить";
	НоваяСтрока.РазрешеноМенятьДействие = Ложь;
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Недействителен'");
	НоваяСтрока.ИмяСвойства = "Недействителен";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.Действие = "Заменить";
	НоваяСтрока.РазрешеноМенятьДействие = Ложь;
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Аутентификация 1С:Предприятия'");
	НоваяСтрока.ИмяСвойства = "АутентификацияСтандартная";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.Действие = "Заменить";
	НоваяСтрока.РазрешеноМенятьДействие = Ложь;		
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Аутентификация OpenID'");
	НоваяСтрока.ИмяСвойства = "АутентификацияOpenID";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.Действие = "Заменить";
	НоваяСтрока.РазрешеноМенятьДействие = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура РассылатьУведомлениеАвтоматическиПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаНастроек

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ТаблицаНастроек

&НаКлиенте
Процедура ТаблицаНастроекПередНачаломИзменения(Элемент, Отказ)
	
	ТабличноеПоле = Элемент;
	
	Если ТабличноеПоле.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеВвода = ТабличноеПоле.ПодчиненныеЭлементы[ТабличноеПоле.Имя + "Значение"];
	ПолеВвода.ОграничениеТипа = ТабличноеПоле.ТекущиеДанные.ДопустимыеТипы;
	
	ВыборГруппИЭлементов = ТабличноеПоле.ТекущиеДанные.ВыборГруппИЭлементов;
	
	Если ЗначениеЗаполнено(ВыборГруппИЭлементов) Тогда
		ПолеВвода.ВыборГруппИЭлементов = ГруппыИЭлементы[ВыборГруппИЭлементов];
	Иначе
		ПолеВвода.ВыборГруппИЭлементов = ГруппыИЭлементы.Авто;
	КонецЕсли;	
	
	Если ТабличноеПоле.ТекущиеДанные.ИмяСвойства = "Пароль" Тогда
		ПолеВвода.РежимВыбораИзСписка = Истина;
		ПолеВвода.СписокВыбора.Очистить();
		ПолеВвода.СписокВыбора.Добавить("Сбросить", НСтр("ru = 'Сбросить на пустой'"));
		ПолеВвода.СписокВыбора.Добавить("УстановитьСлучайный", НСтр("ru = 'Установить случайный'"));
	ИначеЕсли ТабличноеПоле.ТекущиеДанные.ИмяСвойства = "Логин" Тогда
		ПолеВвода.РежимВыбораИзСписка = Истина;
		ПолеВвода.СписокВыбора.Очистить();
		ПолеВвода.СписокВыбора.Добавить("СформироватьИзПолногоИмени", НСтр("ru = 'Сформировать из полного имени'"));
		ПолеВвода.СписокВыбора.Добавить("УстановитьЭлектроннуюПочту", НСтр("ru = 'Установить электронную почту'"));
	Иначе
		ПолеВвода.РежимВыбораИзСписка = Ложь;
		ПолеВвода.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИзменитьНастройкиДоступа(Команда)
	
	ВыбранныеНастройки = Новый Структура("Настройки, Рассылка");
	ВыбранныеНастройки.Настройки = Новый Массив;
	
	Если РассылатьУведомлениеАвтоматически Тогда
		ВыбранныеНастройки.Рассылка = Новый Структура("Шаблон, ВидЭлектронногоАдреса, ТолькоЭлектроннаяПочта", ШаблонУведомления, ВидЭлектронногоАдреса, РассылатьТолькоНаЭлектроннуюПочту);
		Если НЕ ЗначениеЗаполнено(ВыбранныеНастройки.Рассылка.Шаблон) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Шаблон уведомления не заполнен'"),,"ШаблонУведомления");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УстанавливаетсяНстройкаНедействителен = Ложь;
	
	Для каждого СтрокаТЗ Из ТаблицаНастроек Цикл
	
		Если НЕ СтрокаТЗ.ИзменитьНастройку Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЗ.Значение = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указано значение настройки'"),,"ТаблицаНастроек[" + Строка(СтрокаТЗ.ПолучитьИдентификатор()) + "].Значение");
			Возврат;			
		КонецЕсли;
		
		ОписаниеНастройки = Новый Структура("Имя, Значение, Действие");
		ОписаниеНастройки.Имя = СтрокаТЗ.ИмяСвойства;
		ОписаниеНастройки.Значение = СтрокаТЗ.Значение;
		ОписаниеНастройки.Действие = СтрокаТЗ.Действие;
		
		Если ОписаниеНастройки.Имя = "Пароль"
			И ОписаниеНастройки.Значение = "УстановитьСлучайный" Тогда
			
			Если РассылатьУведомлениеАвтоматически И ЗначениеЗаполнено(ШаблонУведомления) Тогда
				
				Если НЕ ШаблонПисьмаСодержитПеременнуюНовыйПароль(ШаблонУведомления) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выберите шаблон сообщения типа ""Сброс пароля""'"),,"ШаблонУведомления");
					Возврат;																					
				КонецЕсли;
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Пользователь не сможет узнать свой пароль без сообщения на электронную почту.
				|Укажите шаблон письма с переменной {{НовыйПароль}}.'"),,"РассылатьУведомлениеАвтоматически");
				Возврат;										
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОписаниеНастройки.Имя = "Недействителен"
			И ОписаниеНастройки.Значение = Истина Тогда
			
			УстанавливаетсяНстройкаНедействителен = Истина;
			
		КонецЕсли;
		
		ВыбранныеНастройки.Настройки.Добавить(ОписаниеНастройки);		
		
	КонецЦикла;
	
	Если УстанавливаетсяНстройкаНедействителен
		И ВыбранныеНастройки.Настройки.Количество() > 1 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Настройка ""Недействителен"" не может быть установлена совместно с другими настройками'"));
		Возврат;										
		
	КонецЕсли;
	
	Если ВыбранныеНастройки.Настройки.Количество() = 0 
		И ВыбранныеНастройки.Рассылка <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Уведомление нельзя отправить без установки хотя бы одной настройки'"),,"РассылатьУведомлениеАвтоматически");
		Возврат;												
		
	КонецЕсли;
	
	Если ВыбранныеНастройки.Настройки.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ВыбранныеНастройки);
		ТекстВопрос = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Настройки будут установлены для %1 пользователей. Продолжить?'"), ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КоличествоПользователей));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопрос, РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПослеЗакрытияВопроса(РезультатВопроса, ВыбранныеНастройки) Экспорт
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        Закрыть(ВыбранныеНастройки);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если НЕ РассылатьУведомлениеАвтоматически Тогда
		ВидЭлектронногоАдреса = Неопределено;
		ШаблонУведомления = Неопределено;
		РассылатьТолькоНаЭлектроннуюПочту = Ложь;
	КонецЕсли;
	
	Элементы.ВидЭлектронногоАдреса.Доступность = РассылатьУведомлениеАвтоматически;
	Элементы.ШаблонУведомления.Доступность = РассылатьУведомлениеАвтоматически;
	Элементы.РассылатьТолькоНаЭлектроннуюПочту.Доступность = РассылатьУведомлениеАвтоматически;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ШаблонПисьмаСодержитПеременнуюНовыйПароль(Знач ШаблонПисьма)
	
	ТипШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонПисьма, "ТипШаблона");
	
	Если ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.СбросПароля Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
